# '#'은 파이썬에서 주석처리 

'''
주석이 한 줄 이상 일 경우 작은 따옴표 3개를 시작과 끝에 표시함

print(10)
print(3.14)
print("박인성")

score = 100
print(score)

score = 200
print(score)

x = 100
print(x)

y = x + 100
print(y)
z = y
print(z)
'''

'''
1. 변수 생성: 변수이름 = 값(수식, 변수 이름)
2. 변수 접근: 변수이름

* 변수 이름을 지을 때 명심할 것
1. 변수의 이름은 영문자, 한글, 숫자, 밑줄문자(_)로 이루어짐.
2. 변수의 이름은 숫자로 시작할 수 없음
3. 변수의 이름은 중간에 공백이 들어가면 안 됨
4. 변수의 이름에 쓰이는 영문자는 대문자와 소문자를 구별
5. 변수의 이름으로 예약어는 사용 불가

* 파이썬에서 제공하는 대표적인 데이터 타입
1. 정수형 2. 실수형 3. 문자열형 4. 논리형

문자열 데이터(str): 글자들이 실(string)에 묶여 있는 형태를 의미
파이썬에서 문자열을 나타낼 때에는 따옴표("") 또는 작은 따옴표('')을 사용
'''

